Import Library

In [16]:
import pandas as pd
import numpy as np

Create dataframe

In [22]:
df1 = pd.DataFrame({
    'name': ['Joko', 'Rama', 'Sintha'],
    'color': ['Blue', 'Blue', 'Purple']
})

df2 = pd.DataFrame({
    'name': ['Paul', 'Rama', 'Sintha'],
    'car_color':['Red', 'Blue', np.nan]
})

Show df1

In [23]:
df1

     name   color
0    Joko    Blue
1    Rama    Blue
2  Sintha  Purple

Show df2

In [24]:
df2

     name car_color
0    Paul       Red
1    Rama      Blue
2  Sintha       NaN

We merge 2 dataframe (df1 & df2)

In [26]:
pd.concat([df1, df2

     name   color car_color
0    Joko    Blue       NaN
1    Rama    Blue       NaN
2  Sintha  Purple       NaN
0    Paul     NaN       Red
1    Rama     NaN      Blue
2  Sintha     NaN       NaN

Inner Join

In [27]:
df1.merge(df2)

     name   color car_color
0    Rama    Blue      Blue
1  Sintha  Purple       NaN

Outer Join

In [28]:
df1.merge(df2, how='outer')

     name   color car_color
0    Joko    Blue       NaN
1    Rama    Blue      Blue
2  Sintha  Purple       NaN
3    Paul     NaN       Red

Left Join

In [29]:
df1.merge(df2, how='left')

     name   color car_color
0    Joko    Blue       NaN
1    Rama    Blue      Blue
2  Sintha  Purple       NaN

Outer Join which keep all values from the left and right merge columns

In [32]:
df1.merge(df2, how='right', left_on='color', right_on='car_color')

  name_x color  name_y car_color
0    NaN   NaN    Paul       Red
1   Joko  Blue    Rama      Blue
2   Rama  Blue    Rama      Blue
3    NaN   NaN  Sintha       NaN

Insert Join Indicator to see where the data in in the row can come from

In [33]:
df1.merge(df2, how='outer', indicator=True)

     name   color car_color      _merge
0    Joko    Blue       NaN   left_only
1    Rama    Blue      Blue        both
2  Sintha  Purple       NaN        both
3    Paul     NaN       Red  right_only